/*****************************************************************************
*
*  PROJECT:     Multi Theft Auto v1.2
*  LICENSE:     See LICENSE in the top level directory
*  FILE:        game_sa/CColModelSA.loader.cpp
*  PURPOSE:     Collision model entity
*  DEVELOPERS:  Martin Turski <quiret@gmx.de>
*
*  Multi Theft Auto is available from http://www.multitheftauto.com/
*
*****************************************************************************/

#include <StdInc.h>
#include "gamesa_renderware.h"

// Private functions.
_mallocNew_t    _mallocNew =            (_mallocNew_t)invalid_ptr;
_freeMemGame_t  _freeMemGame =          (_freeMemGame_t)invalid_ptr;


CColBoundingBox::CColBoundingBox( void )
{
    this->vecBoundMin = CVector( 1.0f, 1.0f, 1.0f );
    this->vecBoundMax = CVector( -1.0f, -1.0f, -1.0f );
}

// Version 1 structs for backwards compatibility.
struct TBounds
{
    float fRadius;
    CVector center;
    CVector min, max;
};

struct TSphere
{
    float radius;
    CVector center;
    CColSurfaceSA surface;
};

// Float packing.
inline short ColFloatToShort( float val )   { return (short)( val * 128.0f ); }
inline float ColShortToFloat( short val )   { return (float)val / 128.0f; }

struct TFace
{
    unsigned int a, b, c;
    CColSurfaceSA surface;
};

struct ColHeaderVersion1    //size: 40 bytes
{
    TBounds         boundingBox;                // 0
};
C_ASSERT( sizeof( ColHeaderVersion1 ) == 40 );

// The documentation presented at gtamodding is partially wrong for San Andreas.
// 14/01/2015: it has been updated and appears to be correct.
struct ColHeaderVersion2    //size: 76 bytes
{
    CColBoundingBox boundingBox;

    unsigned short  numColSpheres;                      // 40
    unsigned short  numColBoxes;                        // 42
    unsigned short  numColMeshFaces;                    // 44
    unsigned char   numWheels;                          // 46
    unsigned char   pad;                                // 47

    union
    {
        unsigned int        flags;                      // 48

        struct
        {
            unsigned int    unkFlag1 : 1;               // 48
            unsigned int    hasAnythingCollidable : 1;           
            unsigned int    unkFlag3 : 1;
            unsigned int    hasFaceGroups : 1;       
            unsigned int    hasShadowMeshFaces : 1;     // unused flag
        };
    };

    unsigned int    offsetColSpheres;                   // 52
    unsigned int    offsetColBoxes;                     // 56
    unsigned int    offsetSuspensionLines;              // 60
    unsigned int    offsetColMeshVertices;              // 64
    unsigned int    offsetColMeshFaces;                 // 68
    unsigned int    offsetTrianglePlanes;               // 72
};
C_ASSERT( sizeof( ColHeaderVersion2 ) == 76 );

struct ColHeaderVersion3 : public ColHeaderVersion2     //size: 88 bytes
{
    int             numShadowMeshFaces;         // 76

    unsigned int    offsetShadowMeshVertices;   // 80
    unsigned int    offsetShadowMeshFaces;      // 84
};
C_ASSERT( sizeof( ColHeaderVersion3 ) == 88 );

struct ColHeaderVersion4 : public ColHeaderVersion3     //size: 92 bytes
{
    int             unk;                        // 88
};
C_ASSERT( sizeof( ColHeaderVersion4 ) == 92 );

AINLINE unsigned int _CalculateVertexCount( CColTriangleSA *faces, int faceCount )
{
    unsigned int numVertices = 0;

    if ( faceCount != 0 )
    {
        if ( faceCount > 0 )
        {
            for ( int n = 0; n < faceCount; n++ )
            {
                CColTriangleSA *face = faces + n;

                if ( numVertices < face->v1 )
                {
                    numVertices = face->v1;
                }

                if ( numVertices < face->v2 )
                {
                    numVertices = face->v2;
                }

                if ( numVertices < face->v3 )
                {
                    numVertices = face->v3;
                }
            }
        }

        numVertices++;
    }

    return numVertices;
}

unsigned int CColDataSA::CalculateNumberOfShadowMeshVertices( void ) const
{
